Repository: microsoft/Power-Fx
Catalog: src/strings/*/PowerFxResources.resw
Source language: en_us
Languages: bg_bg, ca_es, cs_cz, da_dk, de_de, el_gr, es_es, et_ee, eu_es, fi_fi, fr_fr, gl_es, hi_in, hr_hr, hu_hu, it_it, ja_jp, kk_kz, ko_kr, lt_lt, lv_lv, ms_my, nb_no, nl_nl, pl_pl, pt_br, pt_pt, ro_ro, ru_ru, sk_sk, sl_si, sr_cyrl_rs, sr_latn_rs, sv_se, th_th, tr_tr, uk_ua, vi_vn, zh_cn, zh_tw

# HourArg1
source: date_time
bg_bg: дата_и_час
ca_es: data_hora
cs_cz: datum_čas
da_dk: dato_klokkeslæt
de_de: Datum_Uhrzeit
el_gr: ημερομηνία_ώρα
es_es: fecha_hora
et_ee: kuupäev_ja_kellaaeg
eu_es: data_ordua
fi_fi: päivämäärän_kellonaika
fr_fr: date_heure
gl_es: data_hora
hi_in: दिनांक_समय
hr_hr: datum_vrijeme
hu_hu: dátum_idő
it_it: data_ora
ja_jp: 日時
kk_kz: күн_уақыт
ko_kr: 날짜_시간
lt_lt: data_laikas
lv_lv: datums_laiks
ms_my: tarikh_masa
nb_no: dato_klokkeslett
nl_nl: datum_tijd
pl_pl: data_godzina
pt_br: data_hora
pt_pt: data_hora
ro_ro: data_ora
ru_ru: дата_и_время
sk_sk: dátum_čas
sl_si: datum_ura
sr_cyrl_rs: датум_време
sr_latn_rs: datum_vreme
sv_se: datum_tid
th_th: วันที่_เวลา
tr_tr: tarih_saat
uk_ua: дата_час
vi_vn: ngày_giờ
zh_cn: 日期时间
zh_tw: 日期_時間

# AboutHour_date_time
source: The date or time value from which the component will be extracted.
bg_bg: Стойността на дата или час, от която ще се извлече компонентът.
ca_es: El valor de data o hora del qual s'extraurà el component.
cs_cz: Hodnota data nebo času, ze které bude extrahována tato složka
da_dk: Dato- eller tidsværdien, hvorfra komponenten bliver udtrukket.
de_de: Der Datums- oder Uhrzeitwert, aus dem die Komponente extrahiert werden soll.
el_gr: Η τιμή ημερομηνίας ή ώρας από την οποία θα εξαχθεί το στοιχείο.
es_es: Valor de fecha u hora del que se va a extraer el componente.
et_ee: Kuupäev või kellaaeg, millest komponent ekstraktitakse.
eu_es: Osagaia ateratzeko erabiliko den data- edo ordu-balioa.
fi_fi: Päivämäärä- tai aika-arvo, josta komponentti poimitaan.
fr_fr: Valeur de date ou d’heure dont le composant sera extrait.
gl_es: Valor de data ou hora do que se vai extraer o compoñente.
hi_in: वह दिनांक या समय मान जिससे घटक निकाला जाएगा.
hr_hr: Vrijednost datuma ili vremena iz koje će se komponenta dana izdvojiti.
hu_hu: Az a dátum- vagy időérték, amelyből a függvény kinyeri az összetevőt.
it_it: Valore data o ora dal quale verrà estratto il componente.
ja_jp: コンポーネントの抽出元である日付または時刻の値。
kk_kz: Компонент алынатын күн немесе уақыт мәні.
ko_kr: 구성 요소가 추출되는 날짜나 시간 값입니다.
lt_lt: Datos arba laiko reikšmė, iš kurios bus išgautas komponentas.
lv_lv: Datuma vai laika vērtība, no kuras komponents tiks izgūts.
ms_my: Nilai tarikh atau masa yang komponennya akan diekstrak.
nb_no: Dato- eller klokkeslettverdien som komponenten trekkes ut fra.
nl_nl: De datum- of tijdwaarde waaruit het onderdeel wordt geëxtraheerd.
pl_pl: Wartość daty lub godziny, z której zostanie wyodrębniony składnik.
pt_br: Valor de data ou hora do qual o componente será extraído.
pt_pt: O valor da data ou hora em que o componente será extraído.
ro_ro: Valoarea dată sau oră din care va fi extrasă componenta.
ru_ru: Значение даты или времени, из которого будет извлекаться компонент.
sk_sk: Dátumová alebo časová hodnota, z ktorej sa vyextrahuje komponent.
sl_si: Datumska ali časovna vrednosti, iz katere bo izvlečena komponenta.
sr_cyrl_rs: Вредност датума или времена из које ће компонента бити издвојена.
sr_latn_rs: Vrednost datuma ili vremena iz koje će komponenta biti izdvojena.
sv_se: Datum- eller tidsvärdet som komponenten kommer extraheras från.
th_th: ค่าวันที่หรือเวลาจะถูกแยกออกจากคอมโพเนนต์
tr_tr: Bileşenin ayıklanacağı tarih veya saat değeri.
uk_ua: Значення дати або часу, з якого потрібно видобувати компонент.
vi_vn: Giá trị ngày hoặc giờ mà cấu phần sẽ được trích xuất từ đó.
zh_cn: 从中提取该部分的日期或时间值。
zh_tw: 擷取其元件的日期或時間值。

# AboutMinute
source: Returns the minute, a number from 0 to 59.
bg_bg: Връща минутата като число от 0 до 59.
ca_es: Retorna el minut, un nombre del 0 al 59.
cs_cz: Vrátí minuty, číslo od 0 do 59.
da_dk: Returnerer minuttet, et tal fra 0 til 59.
de_de: Gibt die Minute zurück, eine Zahl von 0 bis 59.
el_gr: Επιστρέφει το λεπτό, έναν αριθμό από 0 έως 59.
es_es: Devuelve el minuto, un número entre 0 y 59.
et_ee: Tagastab minuti, mis on arv vahemikus 0–59.
eu_es: Minutua itzultzen du (0 eta 59 arteko zenbaki bat).
fi_fi: Palauttaa minuutin lukuna 0–59.
fr_fr: Retourne les minutes, un nombre compris de 0 à 59.
gl_es: Devolve o minuto, un número de 0 a 59.
hi_in: मिनट लौटाता है, जो कि 0 से 59 की कोई संख्या है.
hr_hr: Vraća minutu, broj od 0 do 59.
hu_hu: A percet jelző, 0 és 59 közötti számot adja vissza.
it_it: Restituisce il minuto, ovvero un numero compreso tra 0 e 59.
ja_jp: 分を返します。0 から 59 の数値です。
kk_kz: 0 және 59 арасындағы сан болатын минутты қайтарады.
ko_kr: 0 ~ 59 사이의 분(숫자)을 반환합니다.
lt_lt: Pateikia minutę, skaičių nuo 0 iki 59.
lv_lv: Atgriež minūti, skaitli no 0 līdz 59.
ms_my: Mengembalikan minit, satu nombor dari 0 hingga 59.
nb_no: Returnerer minuttet, som er et tall fra 0 til 59.
nl_nl: Hiermee wordt het aantal minuten geretourneerd, een getal tussen de 0 en 59.
pl_pl: Zwraca minuty w formie liczby od 0 do 59.
pt_br: Retorna o minuto, um número de 0 a 59.
pt_pt: Devolve o minuto, um número de 0 a 59.
ro_ro: Returnează minutul, un număr de la 0 la 59.
ru_ru: Возвращает минуты в виде числа от 0 до 59.
sk_sk: Vráti minútu – číslo v rozsahu 0 až 59.
sl_si: Vrne minute kot številko med 0 in 59.
sr_cyrl_rs: Враћа минут, број од 0 до 59.
sr_latn_rs: Vraća minut, broj od 0 do 59.
sv_se: Returnerar minuten, ett nummer mellan 0 och 59.
th_th: ส่งกลับค่านาที เป็นตัวเลขจาก 0 ถึง 59
tr_tr: Dakikayı (0 ile 59 arasında bir sayı) döndürür.
uk_ua: Повертає хвилину (число від 0 до 59).
vi_vn: Trả về phút, một số nằm trong khoảng từ 0 đến 59.
zh_cn: 返回分钟，从 0 到 59 的数字。
zh_tw: 傳回分鐘，介於 0 到 59 之間的數字。

# MinuteArg1
source: date_time
bg_bg: дата_и_час
ca_es: data_hora
cs_cz: datum_čas
da_dk: dato_klokkeslæt
de_de: Datum_Uhrzeit
el_gr: ημερομηνία_ώρα
es_es: fecha_hora
et_ee: kuupäev_ja_kellaaeg
eu_es: data_ordua
fi_fi: päivämäärän_kellonaika
fr_fr: date_heure
gl_es: data_hora
hi_in: दिनांक_समय
hr_hr: datum_vrijeme
hu_hu: dátum_idő
it_it: data_ora
ja_jp: 日時
kk_kz: күн_уақыт
ko_kr: 날짜_시간
lt_lt: data_laikas
lv_lv: datums_laiks
ms_my: tarikh_masa
nb_no: dato_klokkeslett
nl_nl: datum_tijd
pl_pl: data_godzina
pt_br: data_hora
pt_pt: data_hora
ro_ro: data_ora
ru_ru: дата_и_время
sk_sk: dátum_čas
sl_si: datum_ura
sr_cyrl_rs: датум_време
sr_latn_rs: datum_vreme
sv_se: datum_tid
th_th: วันที่_เวลา
tr_tr: tarih_saat
uk_ua: дата_час
vi_vn: ngày_giờ
zh_cn: 日期时间
zh_tw: 日期_時間

# AboutMinute_date_time
source: The date or time value from which the minute component will be extracted.
bg_bg: Стойността на дата или час, от която ще се извлече компонентът на минутата.
ca_es: El valor de data o hora del qual s'extraurà el component minut.
cs_cz: Hodnota data nebo času, ze které se budou extrahovat minuty
da_dk: Dato- eller tidsværdien, hvorfra minut-komponenten bliver udtrukket.
de_de: Der Datums- oder Uhrzeitwert, aus dem die Minutenkomponente extrahiert werden soll.
el_gr: Η τιμή ημερομηνίας ή ώρας, από την οποία θα εξαχθεί το στοιχείο λεπτού.
es_es: Valor de fecha u hora del que se va a extraer el componente de minuto.
et_ee: Kuupäeva- või kellaajaväärtus, millest ekstraktitakse minutikomponent.
eu_es: Minutu-osagaia ateratzeko erabiliko den data- edo ordu-balioa.
fi_fi: Päivämäärä- tai aika-arvo, josta minuuttikomponentti poimitaan.
fr_fr: Valeur de date ou d’heure dont le composant minute sera extrait.
gl_es: Valor de data ou hora do que se vai extraer o compoñente "minuto".
hi_in: वह दिनांक या समय मान जिससे मिनट घटक को निकाला जाएगा.
hr_hr: Vrijednost datuma ili vremena iz koje će se komponenta minute izdvojiti.
hu_hu: Az a dátum- vagy időérték, amelyből a függvény kinyeri a perc összetevőt.
it_it: Valore data o ora dal quale verrà estratto il componente relativo al minuto.
ja_jp: 分コンポーネントを抽出する元となる日付または時刻の値。
kk_kz: Минут компоненті алынатын күн немесе уақыт мәні.
ko_kr: 분 구성 요소가 추출되는 날짜 또는 시간 값입니다.
lt_lt: Datos arba laiko reikšmė, iš kurios bus išgautas minučių komponentas.
lv_lv: Datuma vai laika vērtība, no kuras minūtes komponents tiks izgūts.
ms_my: Nilai tarikh atau masa daripadanya komponen minit akan diekstrak.
nb_no: Dato- eller klokkeslettverdien som minuttkomponenten blir trukket ut fra.
nl_nl: De datum- of tijdwaarde waaruit het minuutgedeelte wordt geëxtraheerd.
pl_pl: Wartość daty lub godziny, z której zostanie wyodrębniony składnik minuty.
pt_br: Valor de data ou hora do qual o componente de minutos será extraído.
pt_pt: O valor de data ou de hora a partir do qual o componente minuto será extraído.
ro_ro: Valoarea dată sau oră din care va fi extrasă componenta minut.
ru_ru: Значение даты или времени, из которого будет извлекаться компонент минуты.
sk_sk: Dátumová alebo časová hodnota, z ktorej sa vyextrahuje komponent minút.
sl_si: Datumska ali časovna vrednosti, iz katere bo izvlečena komponenta minute.
sr_cyrl_rs: Вредност датума или времена из које ће компонента минута бити издвојена.
sr_latn_rs: Vrednost datuma ili vremena iz koje će komponenta minuta biti izdvojena.
sv_se: Datum eller tidsvärdet från vilket minutkomponenten kommer att extraheras.
th_th: ค่าวันที่หรือเวลาจะถูกแยกออกจากคอมโพเนนต์ minute
tr_tr: Dakika bileşeninin ayıklanacağı tarih veya saat değeri.
uk_ua: Значення дати або часу, звідки потрібно видобути компонент хвилин.
vi_vn: Giá trị ngày hoặc giờ, trong đó thành phần phút sẽ được trích xuất.
zh_cn: 将从中提取分钟部分的日期或时间值。
zh_tw: 將擷取其分鐘元件的日期或時間值。

# AboutSecond
source: Returns the second, a number from 0 to 59.
bg_bg: Връща секундата като число от 0 до 59.
ca_es: Retorna el segon, un nombre del 0 al 59.
cs_cz: Vrátí sekundy, číslo od 0 do 59.
da_dk: Returnerer sekundet, et tal fra 0 til 59.
de_de: Gibt die Sekunde zurück, eine Zahl von 0 bis 59.
el_gr: Επιστρέφει το δευτερόλεπτο, ένας αριθμός από 0 έως 59.
es_es: Devuelve el segundo, un número entre 0 y 59.
et_ee: Tagastab sekundi, mis on arv vahemikus 0–59.
eu_es: Segundoa itzultzen du (0 eta 59 arteko zenbaki bat).
fi_fi: Palauttaa sekunnin lukuna 0–59.
fr_fr: Retourne les secondes, un nombre compris entre 0 et 59.
gl_es: Devolve o segundo, un número de 0 a 59.
hi_in: सेकंड लौटाता है, जो कि 0 से 59 की कोई संख्या है.
hr_hr: Vraća sekundu, broj od 0 do 59.
hu_hu: A másodpercet jelző, 0 és 59 közötti számot adja vissza.
it_it: Restituisce il secondo, ovvero un numero compreso tra 0 e 59.
ja_jp: 秒を返します。0 から 59 の数値です。
kk_kz: 0 және 59 арасындағы сан болатын секундты қайтарады.
ko_kr: 0 ~ 59 사이의 초를 반환합니다.
lt_lt: Pateikia sekundę, skaičių nuo 0 iki 59.
lv_lv: Atgriež sekundi, skaitli no 0 līdz 59.
ms_my: Mengembalikan saat, satu nombor dari 0 hingga 59.
nb_no: Returnerer sekundet, som er et tall fra 0 til 59.
nl_nl: Hiermee wordt het aantal seconden geretourneerd, een getal tussen 0 en 59.
pl_pl: Zwraca sekundy w formie liczby od 0 do 59.
pt_br: Retorna o segundo, um número de 0 a 59.
pt_pt: Devolve o segundo, um número de 0 a 59.
ro_ro: Returnează secunda, un număr de la 0 la 59.
ru_ru: Возвращает секунды в виде числа от 0 до 59.
sk_sk: Vráti sekundu – číslo v rozsahu 0 až 59.
sl_si: Vrne sekunde kot številko med 0 in 59.
sr_cyrl_rs: Враћа секунд, број од 0 до 59.
sr_latn_rs: Vraća sekund, broj od 0 do 59.
sv_se: Returnerar sekunden, ett tal från 0 till 59.
th_th: ส่งกลับค่าวินาที เป็นตัวเลขจาก 0 ถึง 59
tr_tr: 0 ile 59 arasındaki bir sayı olan saniyeyi döndürür.
uk_ua: Повертає секунду (число від 0 до 59).
vi_vn: Trả về giây, một số nằm trong khoảng từ 0 đến 59.
zh_cn: 返回秒，从 0 到 59 的数字。
zh_tw: 傳回秒，介於 0 到 59 之間的數字。

# SecondArg1
source: date_time
bg_bg: дата_и_час
ca_es: data_hora
cs_cz: datum_čas
da_dk: dato_klokkeslæt
de_de: Datum_Uhrzeit
el_gr: ημερομηνία_ώρα
es_es: fecha_hora
et_ee: kuupäev_ja_kellaaeg
eu_es: data_ordua
fi_fi: päivämäärän_kellonaika
fr_fr: date_heure
gl_es: data_hora
hi_in: दिनांक_समय
hr_hr: datum_vrijeme
hu_hu: dátum_idő
it_it: data_ora
ja_jp: 日時
kk_kz: күн_уақыт
ko_kr: 날짜_시간
lt_lt: data_laikas
lv_lv: datums_laiks
ms_my: tarikh_masa
nb_no: dato_klokkeslett
nl_nl: datum_tijd
pl_pl: data_godzina
pt_br: data_hora
pt_pt: data_hora
ro_ro: data_ora
ru_ru: дата_и_время
sk_sk: dátum_čas
sl_si: datum_ura
sr_cyrl_rs: датум_време
sr_latn_rs: datum_vreme
sv_se: datum_tid
th_th: วันที่_เวลา
tr_tr: tarih_saat
uk_ua: дата_час
vi_vn: ngày_giờ
zh_cn: 日期时间
zh_tw: 日期_時間

# AboutSecond_date_time
source: The date or time value from which the second component will be extracted.
bg_bg: Стойността на дата или час, от която ще се извлече компонентът на секундата.
ca_es: Valor de data o hora del qual s'extraurà el component de segon.
cs_cz: Hodnota data nebo času, ze které se budou extrahovat sekundy
da_dk: Dato- eller tidsværdien, hvorfra sekund-komponenten bliver udtrukket.
de_de: Der Datums- oder Uhrzeitwert, aus dem die Sekundenkomponente extrahiert werden soll.
el_gr: Η τιμή ημερομηνίας ή ώρας, από την οποία θα εξαχθεί το στοιχείο δευτερόλεπτου.
es_es: Valor de fecha u hora del que se va a extraer el componente de segundo.
et_ee: Kuupäeva- või kellaajaväärtus, millest ekstraktitakse sekundikomponent.
eu_es: Segundo-osagaia ateratzeko erabiliko den data- edo ordu-balioa.
fi_fi: Päivämäärä- tai aika-arvo, josta sekuntikomponentti poimitaan.
fr_fr: Valeur de date ou d’heure dont le composant seconde sera extrait.
gl_es: Valor de data ou hora do que se vai extraer o compoñente "segundo".
hi_in: वह दिनांक या समय मान जिससे सेकंड घटक निकाला जाएगा.
hr_hr: Vrijednost datuma ili vremena iz koje će se komponenta sekunde izdvojiti.
hu_hu: Az a dátum- vagy időérték, amelyből a függvény kinyeri a másodperc összetevőt.
it_it: Valore data o ora dal quale verrà estratto il componente relativo al secondo.
ja_jp: 秒コンポーネントを抽出する元となる日付または時刻の値。
kk_kz: Секунд компоненті алынатын күн немесе уақыт мәні.
ko_kr: 초 구성 요소가 추출되는 날짜 또는 시간 값입니다.
lt_lt: Datos arba laiko reikšmė, iš kurios bus išgautas sekundės komponentas.
lv_lv: Datuma vai laika vērtība, no kuras sekundes komponents tiks izgūts.
ms_my: Nilai tarikh atau masa daripadanya komponen saat akan diekstrak.
nb_no: Dato- eller klokkeslettverdien som sekundkomponenten blir trukket ut fra.
nl_nl: De datum- of tijdwaarde waaruit het secondegedeelte wordt geëxtraheerd.
pl_pl: Wartość daty lub godziny, z której zostanie wyodrębniony składnik sekundy.
pt_br: Valor de data ou a hora do qual o componente de segundos será extraído.
pt_pt: O valor de data ou de hora a partir do qual o componente segundo será extraído.
ro_ro: Valoarea dată sau oră din care va fi extrasă componenta secundă.
ru_ru: Значение даты или времени, из которого будет извлекаться компонент секунды.
sk_sk: Dátumová alebo časová hodnota, z ktorej sa vyextrahuje komponent sekúnd.
sl_si: Datumska ali časovna vrednosti, iz katere bo izvlečena komponenta sekunde.
sr_cyrl_rs: Вредност датума или времена из које ће компонента секунде бити издвојена.
sr_latn_rs: Vrednost datuma ili vremena iz koje će komponenta sekunde biti izdvojena.
sv_se: Datum- eller tidsvärdet från vilket sekundkomponenten kommer att extraheras.
th_th: ค่าวันที่หรือเวลาจะถูกแยกออกจากคอมโพเนนต์ second
tr_tr: Saniye bileşeninin ayıklanacağı tarih veya saat değeri.
uk_ua: Значення дати або часу, звідки потрібно видобувати компонент секунди.
vi_vn: Giá trị ngày hoặc giờ, trong đó thành phần giây sẽ được trích xuất.
zh_cn: 将从中提取秒部分的日期和时间值。
zh_tw: 將擷取其秒元件的日期或時間值。
